app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."author_id" = $1 ORDER BY "categories"."created_at" DESC  [["author_id", 1]]
SELECT "category_expenses".* FROM "category_expenses" WHERE "category_expenses"."category_id" IN ($1, $2)  [["category_id", 2], ["category_id", 1]]
---
  def index
    @categories = Category.includes(:category_expenses).where(author: current_user).order(created_at: :desc)

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "category_expenses".* FROM "category_expenses" WHERE "category_expenses"."category_id" = $1 ORDER BY "category_expenses"."created_at" DESC  [["category_id", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" IN ($1, $2)  [["id", 2], ["id", 1]]
---
  def show
    @category = Category.find(params[:id])
    @category_expense = CategoryExpense.includes(:expense).where(category: @category).order(created_at: :desc)

INSERT INTO "categories" ("author_id", "name", "icon", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["name", "rent"], ["icon", "icons/software.png"], ["created_at", "2023-04-01 07:33:03.083717"], ["updated_at", "2023-04-01 07:33:03.083717"]]
---
  def create
    @category = Category.new(category_params)
    @category.author = current_user

    respond_to do |format|
      if @category.save