app/controllers/expenses_controller.rb

  def new
    @expense = Expense.new
    @categories = Category.where(author: current_user)
---
SELECT "categories".* FROM "categories" WHERE "categories"."author_id" = $1  [["author_id", 1]]

  def create
    @expense = Expense.new(expense_params)
    @expense.author = current_user
    return unless @expense.save

    CategoryExpense.create!(expense_id: @expense.id, category_id: params[:category])
---
INSERT INTO "expenses" ("author_id", "name", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["name", "teacher"], ["amount", 0.03], ["created_at", "2023-04-01 06:33:39.408562"], ["updated_at", "2023-04-01 06:33:39.408562"]]
INSERT INTO "category_expenses" ("category_id", "expense_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_id", 1], ["expense_id", 1], ["created_at", "2023-04-01 06:33:39.581755"], ["updated_at", "2023-04-01 06:33:39.581755"]]