app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
  def index
    @transactions = Transaction.all

SELECT "categories".* FROM "categories" WHERE "categories"."author_id" = $1  [["author_id", 1]]
---
  def new
    @transaction = Transaction.new
    @categories = Category.where(author: current_user)

INSERT INTO "transactions" ("name", "amount", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "teacher"], ["amount", 4.0], ["created_at", "2023-03-29 09:40:14.191780"], ["updated_at", "2023-03-29 09:40:14.191780"], ["author_id", 1]]
---
  def create
      @transaction = Transaction.new(transaction_params)
    @transaction.author = current_user
    return unless @transaction.save