app/views/categories/index.html.erb

            <% @total = 0 %>
            <% category.category_expenses.each { |e| @total += e.expense.amount } %>
---
SELECT "categories".* FROM "categories"
SELECT "category_expenses".* FROM "category_expenses" WHERE "category_expenses"."category_id" IN ($1, $2)  [["category_id", 2], ["category_id", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]